//Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
/*
int NaturStepen(int num, int stepen)
{
    int CopyNum = num;
    int r = 0;
   for(int count = 1; count<stepen;count++)
   {
        
        r = CopyNum*num;
        Console.WriteLine(CopyNum);
        CopyNum = r;
   }
   return CopyNum;
}
Console.WriteLine($"{NaturStepen(2,3)} - результат");*/

//Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.