//1 Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
void TwoDigit (int num)
{
    int result = (num % 100) / 10;
    Console.Write($"Второе число -> {result}");
}
TwoDigit(164);
*/
